grevaillot/svd_tools/headers/STM32G07x/rcc.h
#pragma once 

/* --- RCC: Reset and clock control --------------------------------- */

/** @defgroup rcc_registers Reset and clock control Register
@{*/

/** RCC_CR Clock control register **/
#define RCC_CR			MMIO32(RCC_BASE + 0x00)
/** RCC_ICSCR Internal clock sources calibration register **/
#define RCC_ICSCR			MMIO32(RCC_BASE + 0x04)
/** RCC_CFGR Clock configuration register **/
#define RCC_CFGR			MMIO32(RCC_BASE + 0x08)
/** RCC_PLLSYSCFGR PLL configuration register **/
#define RCC_PLLSYSCFGR			MMIO32(RCC_BASE + 0x0c)
/** RCC_CIER Clock interrupt enable register **/
#define RCC_CIER			MMIO32(RCC_BASE + 0x18)
/** RCC_CIFR Clock interrupt flag register **/
#define RCC_CIFR			MMIO32(RCC_BASE + 0x1c)
/** RCC_CICR Clock interrupt clear register **/
#define RCC_CICR			MMIO32(RCC_BASE + 0x20)
/** RCC_IOPRSTR GPIO reset register **/
#define RCC_IOPRSTR			MMIO32(RCC_BASE + 0x24)
/** RCC_AHBRSTR AHB peripheral reset register **/
#define RCC_AHBRSTR			MMIO32(RCC_BASE + 0x28)
/** RCC_APBRSTR1 APB peripheral reset register 1 **/
#define RCC_APBRSTR1			MMIO32(RCC_BASE + 0x2c)
/** RCC_APBRSTR2 APB peripheral reset register 2 **/
#define RCC_APBRSTR2			MMIO32(RCC_BASE + 0x30)
/** RCC_IOPENR GPIO clock enable register **/
#define RCC_IOPENR			MMIO32(RCC_BASE + 0x34)
/** RCC_AHBENR AHB peripheral clock enable register **/
#define RCC_AHBENR			MMIO32(RCC_BASE + 0x38)
/** RCC_APBENR1 APB peripheral clock enable register 1 **/
#define RCC_APBENR1			MMIO32(RCC_BASE + 0x3c)
/** RCC_APBENR2 APB peripheral clock enable register 2 **/
#define RCC_APBENR2			MMIO32(RCC_BASE + 0x40)
/** RCC_IOPSMENR GPIO in Sleep mode clock enable register **/
#define RCC_IOPSMENR			MMIO32(RCC_BASE + 0x44)
/** RCC_AHBSMENR AHB peripheral clock enable in Sleep mode register **/
#define RCC_AHBSMENR			MMIO32(RCC_BASE + 0x48)
/** RCC_APBSMENR1 APB peripheral clock enable in Sleep mode register 1 **/
#define RCC_APBSMENR1			MMIO32(RCC_BASE + 0x4c)
/** RCC_APBSMENR2 APB peripheral clock enable in Sleep mode register 2 **/
#define RCC_APBSMENR2			MMIO32(RCC_BASE + 0x50)
/** RCC_CCIPR Peripherals independent clock configuration register **/
#define RCC_CCIPR			MMIO32(RCC_BASE + 0x54)
/** RCC_BDCR RTC domain control register **/
#define RCC_BDCR			MMIO32(RCC_BASE + 0x5c)
/** RCC_CSR Control/status register **/
#define RCC_CSR			MMIO32(RCC_BASE + 0x60)

/**@}*/


/** @defgroup rcc_cr CR Clock control register
@{*/

/** RCC_CR_PLLRDY PLL clock ready flag **/
#define RCC_CR_PLLRDY		(1 << 25)
/** RCC_CR_PLLON PLL enable **/
#define RCC_CR_PLLON		(1 << 24)
/** RCC_CR_CSSON Clock security system enable **/
#define RCC_CR_CSSON		(1 << 19)
/** RCC_CR_HSEBYP HSE crystal oscillator bypass **/
#define RCC_CR_HSEBYP		(1 << 18)
/** RCC_CR_HSERDY HSE clock ready flag **/
#define RCC_CR_HSERDY		(1 << 17)
/** RCC_CR_HSEON HSE clock enable **/
#define RCC_CR_HSEON		(1 << 16)

#define RCC_CR_HSIDIV_SHIFT		11
#define RCC_CR_HSIDIV_MASK		0x07
/** @defgroup rcc_cr_hsidiv HSIDIV HSI16 clock division factor
@{*/
/**@}*/

/** RCC_CR_HSIRDY HSI16 clock ready flag **/
#define RCC_CR_HSIRDY		(1 << 10)
/** RCC_CR_HSIKERON HSI16 always enable for peripheral kernels **/
#define RCC_CR_HSIKERON		(1 << 9)
/** RCC_CR_HSION HSI16 clock enable **/
#define RCC_CR_HSION		(1 << 8)

/**@}*/

/** @defgroup rcc_icscr ICSCR Internal clock sources calibration register
@{*/


#define RCC_ICSCR_HSITRIM_SHIFT		8
#define RCC_ICSCR_HSITRIM_MASK		0x7f
/** @defgroup rcc_icscr_hsitrim HSITRIM HSI16 clock trimming
@{*/
/**@}*/


#define RCC_ICSCR_HSICAL_SHIFT		0
#define RCC_ICSCR_HSICAL_MASK		0xff
/** @defgroup rcc_icscr_hsical HSICAL HSI16 clock calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cfgr CFGR Clock configuration register
@{*/


#define RCC_CFGR_MCOPRE_SHIFT		28
#define RCC_CFGR_MCOPRE_MASK		0x07
/** @defgroup rcc_cfgr_mcopre MCOPRE Microcontroller clock output prescaler
@{*/
/**@}*/


#define RCC_CFGR_MCOSEL_SHIFT		24
#define RCC_CFGR_MCOSEL_MASK		0x07
/** @defgroup rcc_cfgr_mcosel MCOSEL Microcontroller clock output
@{*/
/**@}*/


#define RCC_CFGR_PPRE_SHIFT		12
#define RCC_CFGR_PPRE_MASK		0x07
/** @defgroup rcc_cfgr_ppre PPRE APB prescaler
@{*/
/**@}*/


#define RCC_CFGR_HPRE_SHIFT		8
#define RCC_CFGR_HPRE_MASK		0x0f
/** @defgroup rcc_cfgr_hpre HPRE AHB prescaler
@{*/
/**@}*/


#define RCC_CFGR_SWS_SHIFT		3
#define RCC_CFGR_SWS_MASK		0x07
/** @defgroup rcc_cfgr_sws SWS System clock switch status
@{*/
/**@}*/


#define RCC_CFGR_SW_SHIFT		0
#define RCC_CFGR_SW_MASK		0x07
/** @defgroup rcc_cfgr_sw SW System clock switch
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsyscfgr PLLSYSCFGR PLL configuration register
@{*/


#define RCC_PLLSYSCFGR_PLLR_SHIFT		29
#define RCC_PLLSYSCFGR_PLLR_MASK		0x07
/** @defgroup rcc_pllsyscfgr_pllr PLLR PLL VCO division factor R for PLLRCLK clock output
@{*/
/**@}*/

/** RCC_PLLSYSCFGR_PLLREN PLLRCLK clock output enable **/
#define RCC_PLLSYSCFGR_PLLREN		(1 << 28)

#define RCC_PLLSYSCFGR_PLLQ_SHIFT		25
#define RCC_PLLSYSCFGR_PLLQ_MASK		0x07
/** @defgroup rcc_pllsyscfgr_pllq PLLQ PLL VCO division factor Q for PLLQCLK clock output
@{*/
/**@}*/

/** RCC_PLLSYSCFGR_PLLQEN PLLQCLK clock output enable **/
#define RCC_PLLSYSCFGR_PLLQEN		(1 << 24)

#define RCC_PLLSYSCFGR_PLLP_SHIFT		17
#define RCC_PLLSYSCFGR_PLLP_MASK		0x1f
/** @defgroup rcc_pllsyscfgr_pllp PLLP PLL VCO division factor P for PLLPCLK clock output
@{*/
/**@}*/

/** RCC_PLLSYSCFGR_PLLPEN PLLPCLK clock output enable **/
#define RCC_PLLSYSCFGR_PLLPEN		(1 << 16)

#define RCC_PLLSYSCFGR_PLLN_SHIFT		8
#define RCC_PLLSYSCFGR_PLLN_MASK		0x7f
/** @defgroup rcc_pllsyscfgr_plln PLLN PLL frequency multiplication factor N
@{*/
/**@}*/


#define RCC_PLLSYSCFGR_PLLM_SHIFT		4
#define RCC_PLLSYSCFGR_PLLM_MASK		0x07
/** @defgroup rcc_pllsyscfgr_pllm PLLM Division factor M of the PLL input clock divider
@{*/
/**@}*/


#define RCC_PLLSYSCFGR_PLLSRC_SHIFT		0
#define RCC_PLLSYSCFGR_PLLSRC_MASK		0x03
/** @defgroup rcc_pllsyscfgr_pllsrc PLLSRC PLL input clock source
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER Clock interrupt enable register
@{*/

