grevaillot/svd_tools/headers/STM32G07x/rcc.h
/** @defgroup rcc_apbsmenr2 APBSMENR2 APB peripheral clock enable in Sleep mode register 2
@{*/

/** RCC_APBSMENR2_ADCSMEN ADC clock enable during Sleep mode **/
#define RCC_APBSMENR2_ADCSMEN		(1 << 20)
/** RCC_APBSMENR2_TIM17SMEN TIM16 timer clock enable during Sleep mode **/
#define RCC_APBSMENR2_TIM17SMEN		(1 << 18)
/** RCC_APBSMENR2_TIM16SMEN TIM16 timer clock enable during Sleep mode **/
#define RCC_APBSMENR2_TIM16SMEN		(1 << 17)
/** RCC_APBSMENR2_TIM15SMEN TIM15 timer clock enable during Sleep mode **/
#define RCC_APBSMENR2_TIM15SMEN		(1 << 16)
/** RCC_APBSMENR2_TIM14SMEN TIM14 timer clock enable during Sleep mode **/
#define RCC_APBSMENR2_TIM14SMEN		(1 << 15)
/** RCC_APBSMENR2_USART1SMEN USART1 clock enable during Sleep mode **/
#define RCC_APBSMENR2_USART1SMEN		(1 << 14)
/** RCC_APBSMENR2_SPI1SMEN SPI1 clock enable during Sleep mode **/
#define RCC_APBSMENR2_SPI1SMEN		(1 << 12)
/** RCC_APBSMENR2_TIM1SMEN TIM1 timer clock enable during Sleep mode **/
#define RCC_APBSMENR2_TIM1SMEN		(1 << 11)
/** RCC_APBSMENR2_SYSCFGSMEN SYSCFG, COMP and VREFBUF clock enable during Sleep mode **/
#define RCC_APBSMENR2_SYSCFGSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr CCIPR Peripherals independent clock configuration register
@{*/


#define RCC_CCIPR_ADCSEL_SHIFT		30
#define RCC_CCIPR_ADCSEL_MASK		0x03
/** @defgroup rcc_ccipr_adcsel ADCSEL ADCs clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_RNGDIV_SHIFT		28
#define RCC_CCIPR_RNGDIV_MASK		0x03
/** @defgroup rcc_ccipr_rngdiv RNGDIV Division factor of RNG clock divider
@{*/
/**@}*/


#define RCC_CCIPR_RNGSEL_SHIFT		26
#define RCC_CCIPR_RNGSEL_MASK		0x03
/** @defgroup rcc_ccipr_rngsel RNGSEL RNG clock source selection
@{*/
/**@}*/

/** RCC_CCIPR_TIM15SEL TIM15 clock source selection **/
#define RCC_CCIPR_TIM15SEL		(1 << 24)
/** RCC_CCIPR_TIM1SEL TIM1 clock source selection **/
#define RCC_CCIPR_TIM1SEL		(1 << 22)

#define RCC_CCIPR_LPTIM2SEL_SHIFT		20
#define RCC_CCIPR_LPTIM2SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim2sel LPTIM2SEL LPTIM2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPTIM1SEL_SHIFT		18
#define RCC_CCIPR_LPTIM1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lptim1sel LPTIM1SEL LPTIM1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2S2SEL_SHIFT		14
#define RCC_CCIPR_I2S2SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2s2sel I2S2SEL I2S1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_I2C1SEL_SHIFT		12
#define RCC_CCIPR_I2C1SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_LPUART1SEL_SHIFT		10
#define RCC_CCIPR_LPUART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_lpuart1sel LPUART1SEL LPUART1 clock source selection
@{*/
/**@}*/

/** RCC_CCIPR_CECSEL HDMI CEC clock source selection **/
#define RCC_CCIPR_CECSEL		(1 << 6)

#define RCC_CCIPR_USART2SEL_SHIFT		2
#define RCC_CCIPR_USART2SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart2sel USART2SEL USART2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_USART1SEL_SHIFT		0
#define RCC_CCIPR_USART1SEL_MASK		0x03
/** @defgroup rcc_ccipr_usart1sel USART1SEL USART1 clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_bdcr BDCR RTC domain control register
@{*/

/** RCC_BDCR_LSCOSEL Low-speed clock output selection **/
#define RCC_BDCR_LSCOSEL		(1 << 25)
/** RCC_BDCR_LSCOEN Low-speed clock output (LSCO) enable **/
#define RCC_BDCR_LSCOEN		(1 << 24)
/** RCC_BDCR_BDRST RTC domain software reset **/
#define RCC_BDCR_BDRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

#define RCC_BDCR_RTCSEL_SHIFT		8
#define RCC_BDCR_RTCSEL_MASK		0x03
/** @defgroup rcc_bdcr_rtcsel RTCSEL RTC clock source selection
@{*/
/**@}*/

/** RCC_BDCR_LSECSSD CSS on LSE failure Detection **/
#define RCC_BDCR_LSECSSD		(1 << 6)
/** RCC_BDCR_LSECSSON CSS on LSE enable **/
#define RCC_BDCR_LSECSSON		(1 << 5)

#define RCC_BDCR_LSEDRV_SHIFT		3
#define RCC_BDCR_LSEDRV_MASK		0x03
/** @defgroup rcc_bdcr_lsedrv LSEDRV LSE oscillator drive capability
@{*/
/**@}*/

/** RCC_BDCR_LSEBYP LSE oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY LSE oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON LSE oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR Control/status register
@{*/

/** RCC_CSR_LPWRRSTF Low-power reset flag **/
#define RCC_CSR_LPWRRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_IWDGRSTF Independent window watchdog reset flag **/
#define RCC_CSR_IWDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PWRRSTF BOR or POR/PDR flag **/
#define RCC_CSR_PWRRSTF		(1 << 27)
/** RCC_CSR_PINRSTF Pin reset flag **/
#define RCC_CSR_PINRSTF		(1 << 26)
/** RCC_CSR_OBLRSTF Option byte loader reset flag **/
#define RCC_CSR_OBLRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flags **/
#define RCC_CSR_RMVF		(1 << 23)
/** RCC_CSR_LSIRDY LSI oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION LSI oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/
